/*
This names for program randname
Эта база Русских имён для программы randname
For randname v2.0
*/

#define MAX_NAME_WOMEN 114
#define MAX_NAME_MALE 114
#define MAX_RNAME_WOMEN 160
#define MAX_RNAME_MALE 182
#define MAX_EN_NAME_WOMEN 100
#define MAX_EN_NAME_MALE 100


	char *name_women[MAX_NAME_WOMEN] = {"Александра","Алёна","Алина","Алиса","Алла","Анастасия","Ангелина","Анжела","Анита","Анна",\
							"Анфиса","Ариана","Арина","Архиделия","Асия","Ася","Афанасья","Вадентина","Валерия","Василиса",\
							"Вера","Вероника","Виктория","Виолетта","Владислава","Владлена","Габриэлла","Галина","Глафира",\
							"Гортензия","Гульнара","Дана","Дарья","Джулия","Диана","Динара","Ева","Евгения","Екатерина",\
							"Елена","Елизавета","Жанна","Зоя","Изобелла","Изольда","Илана","Инга","Инна","Ирина","Карина",\
							"Клавдия","Клара","Кристина","Ксения","Лада","Лана","Лариса","Лаура","Лаура","Лейсан","Леся",\
							"Лиана","Лидия","Лилия","Лейла","Леонида","Линда","Лола","Любовь","Людмила","Майя","Мальвина",\
							"Маргарита","Марианна","Марина","Мария","Марта","Мила","Милана","Милена","Надежда","Наталья",\
							"Ника","Николь","Нина","Нинель","Оксана","Олеся","Ольга","Полина","Раиса","Регина","Рада",\
							"Рената","Роза","Роксана","Сабрина","Сарра","Светлана","Софья","Стелла","Сусанна","Татьяна",\
							"Ульяна","Фая","Фелиция","Шакира","Элла","Эльвира","Эльза","Эля","Эмилия","Эмма","Юлия"};

	char *name_male[MAX_NAME_MALE] = {"Адам","Адриан","Аким","Алан","Александр","Алексей","Альберт","Альфред","Анатолий","Андре",\
							"Андрей","Антон","Арам","Аристарх","Аркадий","Арно","Арсений","Артём","Аскольд","Афанасий",\
							"Богдан","Борис","Вадим","Валентин","Валерий","Василий","Виктор","Вилли","Виталий","Владимир",\
							"Владислав","Вечеслав","Гарри","Геннадий","Генрих","Георгий","Глеб","Григорий","Давид","Данияр",\
							"Денис","Джамал","Евгений","Егор","Елизар","Елисей","Ефим","Иван","Игнат","Игорь","Илья",\
							"Иннокентий","Иосиф","Исаак","Киррилл","Константин","Кузьма","Лаврентий","Леон","Леонид",\
							"Леонтий","Макар","Максим","Марат","Марк","Матвей","Мечеслав","Милан","Михаил","Мурат","Назар",\
							"Никита","Николай","Олег","Орест","Оскар","Павел","Пётр","Прохор","Равиль","Рамиль","Ратмир",\
							"Раис","Рафик","Ринат","Роберт","Ричард","Родион","Роман","Руслан","Рустан","Святослав","Семён",\
							"Сергей","Станислав","Степан","Теодор","Тимофей","Тимур","Томас","Фёдор","Филлипп","Фома",\
							"Эдвард","Эдгар","Эдуард","Эмиль","Эммануил","Эрик","Юлий","Юрий","Яким","Ян","Ярослав"};

	char *rare_name_women[MAX_RNAME_WOMEN] = {"Агата","Агнесса","Агриппина","Ада","Айгуль","Аида","Акулина","Алсу","Амаль","Аполлинария",\
			"Ариадна","Архелия","Ассоль","Астрид","Беатриса","Белла","Бенедикта","Берта","Бирута","Бронислава","Ванда",\
			"Венера","Веста","Вилора","Виргиния","Виринея","Габриэлла","Гаянэ","Гелла","Генриетта","Гертруда","Глория",\
			"Грета","Дайна","Далия","Данута","Джемма","Дилара","Джульетта","Диодора","Динара","Дионисия","Доля","Дора",\
			"Евангелина","Есения","Жасмин","Жозефинна","Забава","Заира","Замира","Зара","Зарема","Зарина","Зита","Иванна",\
			"Иветта","Ивона","Илария","Илзе","Илана","Илона","Иоанна","Илоанта","Ираида","Ирена","Ирма","Ия","Июлия","Марика",\
			"Калерия","Камилла","Капитолина","Карима","Каролина","Катарина","Кира","Клементина","Констанция","Кора","Лайма",\
			"Лана","Леокадия","Леана","Лилиана","Лурия","Лукерья","Люция","Магда","Мадина","Магдалина","Малика","Марианна",\
			"Марселина","Марта","Марфа","Марьям","Матильда","Мелания","Мелисса","Мила","Милана","Милолика","Мира","Мирра",\
			"Михайлина","Михаэлла","Моника","Нана","Нателла","Нелли","Неонила","Одетта","Офелия","Пелагея","Прасковья",\
			"Ревекка","Рада","Ревекка","Роберта","Румия","Саида","Сандра","Сания","Северинна","Селена","Сильва","Симона",\
			"Созия","Стефания","Сусанна","Таира","Тала","Теодора","Тина","Томилла","Устина","Фаиза","Фания","Фаня","Фарида",\
			"Франсуаза","Фрида","Харита","Хильда","Христя","Целилия","Эллада","Эдда","Эльга","Эльза","Эльмира","Эрика",\
			"Эрнестина","Юзефа","Юния","Юнона","Юханна","Ядвига","Янита"};

	char *rare_name_male[MAX_RNAME_MALE] = {"Аарон","Абрам","Аваз","Аваакум","Август","Авдей","Авраам","Автандил","Агап","Агафон",\
			"Аггей","Адис","Адольф","Адриан","Азарий","Айрат","Аким","Алан","Али","Алихан","Алоиз","Амадей","Амедеус",\
			"Амаяк","Амврисий","Анвар","Андиом","Ануфрий","Аполлинарий","Арам","Арий","Арно","Аскольд","Бежен","Бенедикт",\
			"Берек","Бернар","Богдан","Боголюб","Болеслав","Бруно","Вальтер","Вардан","Варлаам","Велизар","Велор","Венедикт",\
			"Викентин","Вилен","Виссарион","Витаутас","Витольд","Волорад","Вольдемар","Гавриил","Галактион","Гарри","Гастон",\
			"Гаяс","Гевор","Геворг","Геральд","Герман","Герасим","Гордей","Гордон","Градимир","Гурий","Дамир","Демид",\
			"Демьян","Динасий","Евграф","Евсей","Евстафий","Емельян","Еремей","Ермолай","Ерофей","Жан","Ждан","Жорн","Заур",\
			"Захар","Зигмунд","Ибрагим","Иероним","Измаил","Илиан","Илларион","Ильхам","Ион","Ионос","Ипполин","Ираклий",\
			"Иржи","Исай","Искандер","Карим","Ким","Клемент","Клим","Клод","Кондрат","Корней","Корнилий","Лев","Лаврентий",\
			"Леван","Левон","Ленар","Леон","Лука","Мадлен","Май","Максимилиян","Максуд","Мануил","Марсель","Мирон","Модест",\
			"Мераб","Мефодий","Мстислав","Муслим","Назар","Наиль","Натан","Нестор","Никанор","Нифонт","Норманн","Овидий",\
			"Олан","Орест","Осип","Пимен","Парамон","Радий","Расим","Ратибор","Ратмир","Рафаил","Рем","Ренольд","Рифат",\
			"Ролан","Рубен","Сабир","Савва","Северин","Соломон","Станимер","Стивен","Стоян","Таис","Талик","Тамаз","Тельман",\
			"Тибор","Тигран","Тигрий","Тит","Тихон","Ульманас","Фанис","Фарид","Фархад","Феликс","Фидель","Флорентий","Фуад",\
			"Франц","Харитон","Христиан","Христофор","Эдмунд","Эмиль","Юлиан","Юхим","Януарий","Яромир"};

	char *eng_name_male[MAX_EN_NAME_MALE] = {"Jacob","Michael","Joshua","Matthew","Ethan","Andrew","Daniel","William","Joseph","Christopher",\
			"Anthony","Ryan","Nicholas","David","Alexander","Tyler","James","John","Dylan","Nathan","Jonathan","Brandon","Samuel",\
			"Christian","Benjamin","Zachary","Logan","Jose","Noah","Justin","Elijah","Gabriel","Caleb","Kevin","Austin","Robert",\
			"Thomas","Connor","Evan","Aidan","Jack","Luke","Jordan","Angel","Isaiah","Isaac","Jason","Jackson","Hunter","Cameron",\
			"Gavin","Mason","Aaron","Juan","Kyle","Charles","Luis","Adam","Brian","Aiden","Eric","Jayden","Alex","Bryan","Sean",\
			"Owen","Lucas","Nathaniel","Ian","Jesus","Carlos","Adrian","Diego","Julian","Cole","Ashton","Steven","Jeremiah",\
			"Timothy","Chase","Devin","Seth","Jaden","Colin","Cody","Landon","Carter","Hayden","Xavier","Wyatt","Dominic","Richard",\
			"Antonio","Jesse","Blake","Sebastian","Miguel","Jake","Alejandro","Patrick"};

	char *eng_name_women[MAX_EN_NAME_WOMEN] = {"Emily","Emma","Madison","Olivia","Hannah","Abigail","Isabella","Ashley","Samantha","Elizabeth",\
			"Alexis","Sarah","Grace","Alyssa","Sophia","Lauren","Brianna","Kayla","Natalie","Anna","Jessica","Taylor","Chloe",\
			"Hailey","Ava","Jasmine","Sydney","Victoria","Ella","Mia","Morgan","Julia","Kaitlyn","Rachel","Katherine","Megan",\
			"Alexandra","Jennifer","Destiny","Allison","Savannah","Haley","Mackenzie","Brooke","Maria","Nicole","Makayla","Trinity",\
			"Kylie","Kaylee","Paige","Lily","Faith","Zoe","Stephanie","Jenna","Irea","Riley","Katelyn","Angelina","Kimberly",\
			"Madeline","Mary","Leah","Lillian","Michelle","Amia","Sara","Sofia","Jordan","Alexa","Rebecca","Gabrielle","Caroline",\
			"Vanessa","Gabriella","Avery","Marissa","Ariana","Audrey","Jada","Autumn","Evelyn","Jocelyn","Maya","Arianna","Isabel",\
			"Amber","Melanie","Diana","Danielle","Sierra","Leslie","Aaliyah","Erin","Amelia","Molly","Claire","Bailey","Melissa"};
